Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The next section discusses how to use indirect calls to efficiently accomplish a similar effect.
ja: 次のセクションでは、間接呼び出しを使用して同様の効果を効率的に達成する方法について説明します。

source: The next step is to parse each string into an object called an expression, represented by the Julia type Expr:
ja: 次のステップは、各文字列をparseに変換することです。 は、JuliaタイプExpr:で表される表現と呼ばれるオブジェクトになります。

source: The next two steps (selecting the output array and implementation) are dependent upon determining a single answer for a given set of arguments.
ja: 次の2つのステップ(出力配列と実装を選択)は、次のように依存します。 指定された引数の集合に対する単一の応答を決定することです。

source: The notation T(x) or convert(T,x) converts x to a value of type T.
ja: 表記法 T(x) または convert(T,x)は、 x を T型の値に変換します。

source: The notation Vararg{T,N} is used to indicate such a constraint.
ja: Vararg{T,N}という記法は、そういう制約のために使用われます。

source: The number of items in each dimension, if known
ja: 各次元のアイテム数(既知の場合)

source: The number of items, if known
ja: 品目数(既知の場合)

source: The only explicitly disallowed names for variables are the names of built-in statements:
ja: ビルトインステートメントの名前のみを変数名として使用することはできません

source: The only solution is to allow creating an incompletely initialized instance of SelfReferential with an unassigned obj field, and using that incomplete instance as a valid value for the obj field of another instance, such as, for example, itself.
ja: 唯一の解決策は、不完全に初期化されたインスタンスを作成することです。 SelfReferentialのうち、未割り当てのobjフィールドを指定し、その不完全なインスタンスを有効にして使用します。 他のインスタンスのobjフィールドの値(例えば、それ自体)。

source: The optional bind-to bind_addr[:port] specifies the IP address and port that other workers should use to connect to this worker.
ja: bind-to bind_addr[:port] オプションを指定すると、他のワーカーがそのワーカーと接続する際に使うIPアドレスとポートを設定することもできます。

source: The optional bind-to bind_addr[:port] specifies the ip-address and port that other workers should use to connect to this worker.
ja: bind-to bind_addr[:port] オプションを指定すると、他のワーカーがそのワーカーと接続する際に使うIPアドレスとポートを設定することもできます。

source: The original three-way example requires chaining multiple uses of the ternary operator together:
ja: オリジナルの3ウェイ 例では、三元演算子の複数の使用を一緒に連鎖する必要があります。

source: The outer constructor declaration, on the other hand, defines a method for the general Point constructor which only applies to pairs of values of the same real type.
ja: 一方、外部コンストラクタ宣言は 同じ実数の値のペアにのみ適用される、一般的なポイントコンストラクタのメソッド の双曲線コサインを返します。

source: The parser yields QuoteNodes for simple quoted items like symbols:
ja: パーサは、シンボルのような単純な引用項目に対して、QuoteNodesを生成します。

source: The path of a package uuid named X is determined by these two rules:
ja: Xという名前のパッケージuuidのパスは、次の2つのルールによって決定されます。

source: The paths map in a package directory is simple: it maps subdirectory names to their corresponding entry-point paths.
ja: パッケージディレクトリのパスマップは単純です。サブディレクトリ名は、サブディレクトリ名を対応するエントリポイントパスにマッピングします。

source: The paths map of a project environment is also determined by the manifest file if present and is empty if there is no manifest.
ja: プロジェクト環境のパスマップは、マニフェストファイルが存在する場合は、マニフェストファイルによって決定されます。マニフェストが存在しない場合は、そのファイルが空になります。

source: The plain data types consist of primitive types (e.g. Int) and immutable structs of other plain data types.
ja: プレーン・データ型は、プリミティブ型(例えば、Int)で構成されています。 その他のプレーン・データ型の不変構造体です。

source: The precedence of numeric literal coefficients is slightly lower than that of unary operators such as negation.
ja: 数値リテラル係数の優先順位は、次の値よりもわずかに低くなります。 否定のような単項演算子です。

source: The precedence of numeric literal coefficients is the same as that of unary operators such as negation.
ja: 数値リテラル係数の優先順位は、否定のような単項演算子と同様です。

source: The precedence rules are defined by binary BroadcastStyle calls:
ja: 優先順位ルールは、バイナリBroadcastStyleコールによって定義されます。

source: The primary use for anonymous functions is passing them to functions which take other functions as arguments.
ja: 無名関数の主な用途は、別の関数を引数とする関数に渡すことでしょう。

source: The private Priv depends on the Pub and Zebra packages.
ja: プライベートPrivは、PubおよびZebraパッケージに依存します。

source: The private Priv package is "vendored" inside the App repository.
ja: プライベートPrivパッケージは、アプリケーションリポジトリの内側にあるベンダーである"です。

source: The problem is that we want S to be a larger type than T, so that we can sum many elements with less information loss.
ja: 問題は、SがTよりも大きいタイプであることであるため、多くの要素を合計することができる。 情報損失が少ない。

source: The problem of handling disparate numeric types is delegated to the arithmetic operations in the expression 2x - y.
ja: 異なる数値型を処理する問題は、式2x - yの算術演算に委譲されます。

source: The project file determines what the names and identities of the direct dependencies of a project are.
ja: プロジェクトファイルは、プロジェクトの直接的な依存関係の名前と識別情報を決定します。

source: The public Priv and Zebra packages are in the system depot, where packages installed and managed by the system administrator live.
ja: publicPrivおよびZebraパッケージはシステム・デポ内にあり、システム管理者によってインストールされ、管理されているパッケージが存在します。

source: The public Priv has no dependencies.
ja: publicPrivには依存関係はありません。

source: The question "what is `X`?" is answered by determining the UUID of X.
ja: "what is"X"と"は、XのUUIDを決定することによって答えます。

source: The reasoning is that a && b must be false if a is false, regardless of the value of b, and likewise, the value of a || b must be true if a is true, regardless of the value of b.
ja: なぜなら、bの値にかかわらず、aが偽の時には、a && bは偽でなければならないからです。 同様に、bの値にかかわらず、aが真の時には、a || bは真でなければなりません。

source: The recommended ways to iterate over a whole array are
ja: 配列全体を繰り返し処理するには、次のような方法が推奨されます。

source: The referenced memory can safely be freed or released.
ja: 参照メモリは、安全に解放されたり解放されたりすることができます。

source: The remainder and modulus functions (rem and mod) throw a DivideError when their second argument is zero.
ja: 余りと剰余関数((rem およびmod)は、 2番目の引数は0のとき、DivideErrorをthrowする。

source: The remainder and modulus functions (rem and mod) throw a `DivideError` when their second argument is zero.
ja: 余りおよび絶対値の 関数（rem および mod ）についても、その第二引数が0の際に `DivideError` となります。

source: The result of `view` looks the same as the result of `getindex`, except the data is left in place.
ja: 結果 'view'は、'getindex'の結果と同じであるが データが残されます。

source: The result is a pointer giving the address of the value.
ja: その結果、値のアドレスを示すポインタが表示されます。

source: The result is an N-d dense array with dimensions that are the concatenation of the dimensions of the variable ranges rx, ry, etc. and each F(x,y,...) evaluation returns a scalar.
ja: 結果は、次元の連結である次元を持つN次元の密配列です。 変数範囲rx、ryなど、各F(x,y,...)評価はスカラーを返します。

source: The result of indexing an AbstractArray can itself be an array (for instance when indexing by an AbstractRange).
ja: AbstractArrayのインデックス作成の結果は、それ自体が配列(例えば、インデックス作成の際に)であることができます。 AbstractRange)。

source: The resulting array type depends on the types of the computed elements.
ja: 結果として得られる配列タイプは、計算された要素の種類によって異なります。

source: The resulting array type depends on the types of the computed elements. In order to control the type explicitly, a type can be prepended to the comprehension. For example, we could have requested the result in single precision by writing:
ja: 結果の配列タイプは、計算された要素のタイプに依存します。 明示的にタイプを指定することができます。たとえば、次のように入力することができます。 以下のように記述することによって、単精度での結果が得られます。

source: The return type of the `ccall` is declared as Ptr{gsl_permutation}, since the memory allocated and pointed to by output_ptr is controlled by C (and not Julia).
ja: 'ccall'の戻り型は、Ptr{gsl_mutation}として宣言されている。 出力ptrによって割り当てられ、指示されたメモリーは、C(およびジュリアではない)によって制御されます。

source: The return type should either be Cvoid for Fortran subroutines, or a T for Fortran functions returning the type T.
ja: 戻り値のタイプは、Cvoidである必要があります。 Fortranのサブルーチン、またはTのFortran関数では、Tを返します。

source: The return value from iterate is always either a tuple of a value and a state, or nothing if no elements remain.
ja: 反復からの戻り値 は常に値と状態のタプルであるか、あるいは何もない場合は何もしません。

source: The return value will be a new object initialized to contain a copy of the contents of the referenced memory.
ja: 戻り値は、参照される内容のコピーを含むように初期化された新しいオブジェクトになります。 メモリー。

source: The reverse (passing an object allocated in Julia to be freed by an external library) is equally invalid.
ja: 逆(オブジェクトを渡すこと) 外部ライブラリによって解放されるためにJuliaに割り当てられていることは、同じように無効です。

source: The reverse operation (writing data to a Ptr{T}), can be performed using `unsafe_store!(ptr, value, [index])`.
ja: 逆の操作(Ptr{T}への書き込み)は、"unsafe_store!(ptr,value,[index])`を使って実行することができます。

source: The roots map is determined by the subdirectories X of a package directory for which X/src/X.jl exists and whether X/Project.toml exists and has a top-level uuid entry.
ja: ルートは、X/src/X.jlが存在し、X/Project.トミルが存在し、最上位のuuidエントリが存在するパッケージディレクトリのサブディレクトリXによって決定される。

source: The roots map of the environment is determined by the contents of the project file, specifically, its top-level name and uuid entries and its [deps] section (all optional).
ja: 環境の根は、プロジェクトファイルの内容、特にトップレベルのnameおよびuuidのエントリとその[deps]セクション(すべてオプション)によって決定される。

source: The rules are:
ja: ルールは次のとおりです。

source: The same holds for `setindex!`.
ja: 同じことが`setindex!`に対しても当てはまります。

source: The same relationship holds for min.(a,b) and minimum(a).
ja: min(a,b)と最小(a)と同じ関係が成り立つ。

source: The second and third arguments are both optional, defaulting to the element type and dimensions of A if omitted.
ja: 2番目と3番目の引数は両方とも省略可能です。デフォルトでは、A<x/>の要素タイプと次元は省略されます。

source: The second applies when the given numerator and denominator values have different types: it promotes them to a common type and then delegates construction to the outer constructor for arguments of matching type.
ja: 2番目は、与えられた分子と分母の値がある場合に適用されます。 は異なるタイプを持ち、一般的なタイプにプロモートしてから、次のように構築を行います。 一致するタイプの引数用の外部コンストラクタです。

source: The second argument to `ccall` can optionally be a calling convention specifier (immediately preceding return type).
ja: `ccall'への2番目の引数は、オプションとして、呼び出し規約指定子(即時に)とすることができます。 先行する戻り値のタイプ)。

source: The second syntactic purpose of the : character is to create expression objects without using the explicit Expr constructor.
ja: :文字の2番目の構文目的は、次のような表現オブジェクトを使用せずに表現オブジェクトを作成することです。 明示的なExprコンストラクタです。

source: The set of packages available in a package directory corresponds to the set of subdirectories it contains that look like packages: if X/src/X.jl is a file in a package directory, then X is considered to be a package and X/src/X.jl is the file Julia loads to get X.
ja: パッケージディレクトリで使用可能なパッケージのセットは、パッケージのような外観を含むサブディレクトリのセットに対応します。X/src/X.jlがパッケージディレクトリ内のファイルである場合、Xはパッケージと見なされ、x5/>X/src/X.jlは、Xを取得するためにロードされるファイルジュリアです。

source: The short function syntax is accordingly quite idiomatic, considerably reducing both typing and visual noise.
ja: 短い関数構文を多用するほど、文字数が大幅に少なくなり、見た目もすっきりします。

source: The shortest complete expression after the $ is taken as the expression whose value is to be interpolated into the string.
ja: $ の後の最短の完全な式は、値が文字列に補間される式として解釈されます。

source: The simplest way to achieve this is to define the following additional outer constructor method:
ja: これを実現する最も簡単な方法は、次のように定義することです。 次の追加の外部コンストラクタメソッド:

source: The size of the binary data item is the minimal needed size, if the leading digit of the literal is not 0.
ja: サイズ リテラルの先頭桁が必要ない場合は、バイナリ・データ項目の最小サイズが2進数データ項目となります。 0。

source: The size of the unsigned value is determined by the number of hex digits used:
ja: 符号なしの値の大きさは、使用されている16進数の桁数により決定されます。:

source: The so-called "ternary operator", ?:, is closely related to the if-elseif-else syntax, but is used where a conditional choice between single expression values is required, as opposed to conditional execution of longer blocks of code.
ja: いわゆる「三項演算子」？:は、if-elseif-else構文と密接に関連しています。 前者は単一の式の値を選択するような条件分岐を行う場合に利用されますが、後者は条件式の実行がもっと長いコードのブロックになる場合に使います。

source: The special CartesianIndex{N} object represents a scalar index that behaves like an N-tuple of integers spanning multiple dimensions.
ja: 特殊なCartesianIndex{N}オブジェクトは、スカラーインデックスを表します。 Nのように、複数の次元にまたがる整数の<x/>Nのようになります。

source: The special CartesianIndex{N} object represents a scalar index that behaves like an N-tuple of integers spanning multiple dimensions. For example:
ja: 特殊なCartesianIndex{N}オブジェクトは、スカラーインデックスを表します。 たとえば、複数の次元にまたがる整数のN-タプルのようになります。次に例を示します。

source: The stability property comes at a non-negligible cost, so if you don't need it, you may want to explicitly specify your preferred algorithm, e.g. sort!(v, alg=QuickSort).
ja: 安定性 プロパティーは無視できないコストで発生するため、必要がない場合は、明示的に指定する必要があります。 たとえば、ソート!(v,alg=QuickSort)のような優先アルゴリズムを指定します。

source: The standardized numerator and denominator of a rational value can be extracted using the `numerator` and `denominator`
ja: 標準化された分子と 有理値の分母は、「分子」および「分母」を使って抽出することができます。

source: The state object will be passed back to the iterate function on the next iteration and is generally considered an implementation detail private to the iterable object.
ja: 状態オブジェクトは、次の反復の繰り返し関数に渡されます。 一般的には、iterableオブジェクトに対してプライベートな実装の詳細と見なされます。

source: The static parameters of the function may be used as type parameters in the call signature, as long as they don't affect the layout of the type.
ja: 関数の静的パラメータは、呼び出しシグネチャのタイプパラメータとして使用できます。 タイプのレイアウトに影響を与えない限りです。

source: The strongest legacy of Lisp in the Julia language is its metaprogramming support.
ja: Julia言語でのLispの最も強力なレガシーは、そのメタプログラミングのサポートです。

source: The syntax [A, B, C, ...] constructs a 1-d array (i.e., a vector) of its arguments.
ja: 構文[A,B,C,…]は、その引数の1次元配列(すなわち、ベクトル)を構成します。

source: The syntax [A, B, C, ...] constructs a 1-d array (i.e., a vector) of its arguments. If all arguments have a common (@ref conversion-and-promotion) then they get converted to that type using `convert`.
ja: 構文[A,B,C,.]は、引数の1d配列(ベクトル)を構成します。すべての引数を指定します。 引数には共通の(@ref変換とプロモーション)があります。 'convert`を使用して、そのタイプに変換されます。

source: The syntax new{T,S} allows specifying parameters for the type to be constructed, i.e. this call will return a SummedArray{T,S}.
ja: 構文new{T,S}は、次のことを可能にします。 構成するタイプのパラメータを指定します。つまり、この呼び出しは、SummedArray{T,S}を返します。

source: The third and final kind of environment is one that combines other environments by overlaying several of them, making the packages in each available in a single composite environment.
ja: 3番目と最終的な環境は、複数の環境を重ね合わせることによって、一つの複合環境でパッケージを利用できるようにするというものです。

source: The third outer constructor turns integer values into rationals by supplying a value of 1 as the denominator.
ja: 3番目の外部コンストラクタは整数値を返します。 1の値を分母として供給することにより、合理的になります。

source: The traditional function declaration syntax demonstrated above is equivalent to the following compact "assignment form":
ja: 上に示したような、従来の関数を宣言する構文と、つぎのような、コンパクトな「代入方式」とは同等です。

source: The tuple must be the same size as the SIMD type.
ja: タプルはSIMD型と同じサイズである必要があります。

source: The two expressions constructed above – by parsing and by direct construction – are equivalent:
ja: 上で作成された2つの式(構文解析と直接構築によって)は、次のようになります。

source: The two uses of the ... operator: slurping and splatting
ja: .…演算子の2つの用途:slingingとspliting

source: The type arguments to ccall and @cfunction are evaluated statically, when the method containing the usage is defined.
ja: ccallおよび@cfunctionのタイプ引数は静的に評価されます。 使用されているメソッドが定義されています。

source: The type is defined as:
ja: タイプは次のように定義されます。

source: The type of the first entry of the tuple returned by iterate()
ja: によって返されるタプルの最初のエントリのタイプは()で返されます。

source: The type parameters of a leaf type must be fully defined (no TypeVars are allowed) in order for the instance to be constructed.
ja: インスタンスを構築するには、リーフタイプのタイプパラメータを完全に定義する必要があります(TypeVarsは許可されません)。

source: The type system is described in (@ref man-types) and defining a function in terms of methods chosen by multiple dispatch on run-time argument types is described in Methods.
ja: タイプシステムは@ref man-types)で記述され、関数を定義します。 ランタイム引数の種類に対する複数のディスパッチによって選択されるメソッドについては、メソッドで説明されています。

source: The unary variant states that you intend to implement specific broadcasting behavior and/or output type, and do not wish to rely on the default fallback `Broadcast.DefaultArrayStyle`.
ja: 単項変異体の状態 特定のブロードキャスト動作や出力タイプを実装することを意図しており デフォルトのフォールバック`ブロードキャスト.DefaultArrayStyle'に依存します。

source: The underscore _ can be used as digit separator:
ja: アンダースコア_は、桁区切り記号として使用できます。

source: The updating version of the binary operator is formed by placing a = immediately after the operator.
ja: 二項演算子の更新機能は、演算子の後ろに = を記載することで実行できます。

source: The updating versions of all the binary arithmetic and bitwise operators are:
ja: 更新機能を持つ二項演算子とビット単位の演算子は以下の通りです。:

source: The use of $ for expression interpolation is intentionally reminiscent of (@ref string-interpolation) and (@ref command-interpolation).
ja: 表現補間に$を使用することは意図的に(@ref string interpolation)を連想させます。 (@refコマンドの補間)。

source: The usual representation of a quote form in an AST is an Expr with head :quote:
ja: ASTにおける引用符の典型的な表現はExprであり、head:quoteである。

source: The value can be manipulated through this pointer using `unsafe_load` and `unsafe_store!`.
ja: この値は、以下のように操作して操作することができます。 このポインタは、`unsafe_load'と、"unsafe_store!"を使用します。

source: The value in location I_1[i_1], I_2[i_2], ..., I_n[i_n]
ja: locationI_1[i_1]の値、I_2[i_2]、.…、I_n[i_n]

source: The value of a is used to construct the expression ex which applies the + function to the value 1 and the variable b.
ja: の値は、関数を適用する<x/>の式を構成するために使用される。 値1および変数b。

source: The value of both compound expression constructs is that of the last subexpression.
ja: 複合式の両方の構成要素の値 は最後のサブ式のものです。

source: The value of the variable
ja: 変数の値

source: The value returned by a function is the value of the last expression evaluated, which, by default, is the last expression in the body of the function definition.
ja: 関数の返す値は、最後に評価された式の値で、デフォルトでは関数定義の本体内で、最後尾の式の値になります。

source: The values returned by typemin and typemax are always of the given argument type.
ja: typeminとtypemaxは常に与えられた引数の型である。

source: The values returned by `typemin()` and `typemax()` are always of the given argument type.
ja: `typemin()` および `typemax()` の戻り値は常に指定された引数の型となります。

source: The variable ans is bound to the value of the last evaluated expression whether it is shown or not.
ja: ans という変数は、最後に評価された式の値（それが表示されたか否かに関わらず）に束縛されています。

source: The variable relation is declared inside the if block, but used outside.
ja: 変数relationはifブロックの内側で宣言されていますが、使用されるのは外側です。

source: The variable Sys.KERNEL can be used to handle such cases.
ja: 変数Sys.KERNELは、そのような場合を扱うために使用することができます。

source: The variable Sys.KERNEL can be used to write these special cases.
ja: 変数Sys.KERNELは、そのような場合を扱うために使用することができます。

source: Then, for each MIME type (mime string) that can be displayed on D, one should define a function display(d::D, ::MIME"mime", x) = ... that displays x as that MIME type, usually by calling `show(io, mime, x)` or `repr(io, mime, x)`.
ja: 次に、D上に表示できるMIMEタイプ(mimeストリング)ごとに、次のいずれかを実行する必要があります。 関数ディスプレイ(d::D,:MIME"mime",x)=x12/>を定義します。x12/>は、MIMEタイプとしてxを表示します。 通常は、`show(io,mime,x)`または`repr(io,mime,x)`を呼び出します。

source: There are many other operations that will simply corrupt the runtime system without notification, usually in subtle ways not obviously connected to the bad definition.
ja: その他 通知なしでランタイム・システムを単純に破壊する他の多くの操作 明らかに悪い定義とは関係ありません。

source: There are a couple of noteworthy features of this design:
ja: この設計には、いくつかの注目すべき特徴があります。

source: There are a few more methods we can extend to give Julia more information about this iterable collection.
ja: その他にも、Juliaにこの問題に関する情報を提供する方法がいくつかある。 のリストを参照してください。

source: There are a few noteworthy high-level features about Julia's strings:
ja: Juliaには、文字列に関係する特筆すべき高度な機能があります：

source: There are currently four sorting algorithms available in base Julia:
ja: 現在、基本的なJuliaには4つのソートアルゴリズムが用意されている。

source: There are several functions in the Sys module intended to make this easier: isunix, islinux, isapple, isbsd, and iswindows.
ja: Sysモジュールには、これをより容易にすることを目的とした、いくつかの関数があります。isunix, islinux, isapple, isbsdと iswindowsです。

source: There are several functions intended to make this easier: is_unix, is_linux, is_apple, is_bsd, and is_windows.
ja: Sysモジュールには、これをより容易にすることを目的とした、いくつかの関数があります。isunix, islinux, isapple, isbsd, and iswindows。

source: There are several special types to be aware of, as no other type can be defined to behave the same:
ja: 他のタイプが定義されていないため、以下のように注意すべき特殊なタイプがいくつかあります。 同じ:

source: There are three possible points of return from this function, returning the values of three different expressions, depending on the values of x and y.
ja: この関数には、値を返せる場所が３か所ありますが、３つの異なる式のどの値が返されるのかは、x と y の 値に応じて変化します。

source: There are three specified standard floating-point values that do not correspond to any point on the real number line:
ja: 実数直線上に対応しない3つの浮動小数点値が存在します。

source: There are two Julia constructs that accomplish this: begin blocks and (;) chains.
ja: ジュリアの構成が2あります これは、がブロックと(;)鎖を形成することを意味します。

source: There are two constructs for repeated evaluation of expressions: the while loop and the for loop.
ja: 式を繰り返し評価する制御構造は２つあります。whileループとforループです。

source: There are two constructs for repeated evaluation of expressions: the while loop and the for
ja: 反復評価には2つの構成があります。whileloop and thefor

source: There are two different Priv packages that the application needs—a private one which is a direct dependency and a public one which is an indirect dependency through Pub:
ja: アプリケーションが必要とする2つの異なるPrivパッケージがあります。これは直接依存性であり、Pubを介して間接的依存性であるプライベートです。

source: There are two main ways of doing so:
ja: 主に2つの その方法は次のとおりです。

source: There are various ways to run Julia code and provide options, similar to those available for the perl and ruby programs:
ja: 他の言語（perl や ruby など）のように、Juliaを実行するには様々な方法やオプションがあります。

source: There is a second syntactic form of quoting for multiple expressions: blocks of code enclosed in quote ... end.
ja: 複数の表現に対して引用符で囲まれた2番目の構文形式の構文があります。 引用では、<x/>である。

source: There is a second, more terse syntax for defining a function in Julia.
ja: もっと簡潔に関数を定義する第二の構文もあります。

source: There is also a `broadcast!` function to specify an explicit destination (which can also be accessed in a fusing fashion by .= assignment).
ja: また 'ブロードキャスト!関数は明示的な宛先を指定することができます(これは .=割り当てにより、融合方式でアクセスすることができます。

source: There is one additional special calling convention (@ref Base.llvmcall), which allows inserting calls to LLVM intrinsics directly.
ja: さらに特別な呼び出し規則が一つあります(@ref Base.llvmcall)。 ではLLVM組み込みへの呼び出しを直接挿入することができます。

source: Therefore this syntax is disallowed, and spaces must be used around the operator in such cases.
ja: したがって、この構文は使用できません。また、スペースを使用してスペースを使用する必要があります。 この場合の演算子です。

source: Therefore we want to avoid an interface that allows the user to construct instances of the type SummedArray{Int32,Int32}.
ja: したがって、ユーザーが作成できるインターフェイスを回避したいと考えています。 SummedArray{Int32,Int32}のインスタンスです。

source: Therefore, any Julia function f can be applied elementwise to any array (or other collection) with the syntax f.(A).
ja: したがって、任意のジュリア関数です。 fは、f.(A)という構文を持つ任意の配列(またはその他のコレクション)に対して、要素ごとに適用することができます。

source: Therefore, assignments to i will not be visible to subsequent iterations:
ja: したがって、iへの割り当ては、次の反復では可視ではありません。

source: Therefore, if an Array contains data in the wrong format, it will have to be explicitly converted using a call such as trunc(Int32, a).
ja: したがって、配列が誤った形式でデータを含む場合は、明示的に変換する必要があります。 trunc(Int32,a)のようなコールを使用します。

source: Therefore, the Ref{gsl_permutation} declaration allows pointers managed by C or Julia to be used.
ja: したがって、Ref{gsl_mutation}宣言は、Cによって管理されるポインタを許可する。 ジュリアは使用される。

source: Therefore, the rest of this chapter focuses on the behavior and mechanics of package loading.
ja: したがって、この章の残りはパッケージロードの動作とメカニズムに焦点を当てています。

source: Therefore, when you next upgrade Pub to get the latest bug fixes and features, App will end up—through no action of yours other than upgrading—depending on two different packages named Priv.
ja: したがって、Pubをアップグレードして最新のバグ修正と機能を取得する場合、Appは、<X21/>Privという名前の2つの異なるパッケージに依存してアップグレードする以外の操作は行いません。

source: These are normal functions, which happen to support infix operator syntax, but always evaluate their arguments:
ja: これらは 通常の関数は、インフィックス演算子の構文をサポートしていますが、常にその引数を評価します。

source: These are all single-argument functions, with `atan` also accepting two arguments corresponding to a traditional `atan2` function.
ja: これらはすべて単一引数関数であり、`atan'は2つの引数を受け入れます。 これは従来のatan2関数に対応しています。
